Revit 2026 API

# UIApplicationActiveUIDocument Property

---

Provides access to an object that represents the currently active project.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual UIDocument ActiveUIDocument { get; }
```
```vb
Public Overridable ReadOnly Property ActiveUIDocument As UIDocument
	Get
```
```cpp
public:
virtual property UIDocument^ ActiveUIDocument {
	UIDocument^ get ();
}
```
```fsharp
abstract ActiveUIDocument : UIDocument with get
override ActiveUIDocument : UIDocument with get
```

#### Property Value

UIDocument

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when attempting to modify the property. |

External API commands can access this property in read-only mode only! The ability to modify the property is reserved for future implementations.

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace